// 예제 #20. 현금 조합 찾기
#include <stdio.h>

int main(void) {
    int cnt;
    printf("|--------|--------|--------|\n");
    printf("|  100원 |  500원 | 1000원 |\n");
    printf("|--------|--------|--------|\n");
    for (int h100 = 0; h100 < 31; h100++) {
        for (int h500 = 0; h500 < 7; h500++) {
            for (int h1000 = 0; h1000 < 4; h1000++) {
                if (h100 * 100 + h500 * 500 + h1000 * 1000 == 3000) {
                    printf("| %4d개 | %4d개 | %4d장 |\n", h100, h500, h1000);
                }
            }
        }
    }
    printf("|--------|--------|--------|\n");
    return 0;
}